Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.0.153/svd/PIC32CM5164LE00048.svd
               <register>
                  <name>CTRLB</name>
                  <description>USART_EXT Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>CHSIZE</name>
                        <description>Character Size</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CHSIZESelect</name>
                           <enumeratedValue>
                              <name>8_BIT</name>
                              <description>8 Bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>9_BIT</name>
                              <description>9 Bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>5_BIT</name>
                              <description>5 Bits</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>6_BIT</name>
                              <description>6 Bits</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>7_BIT</name>
                              <description>7 Bits</description>
                              <value>0x7</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SBMODE</name>
                        <description>Stop Bit Mode</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SBMODESelect</name>
                           <enumeratedValue>
                              <name>1_BIT</name>
                              <description>One Stop Bit</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2_BIT</name>
                              <description>Two Stop Bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>COLDEN</name>
                        <description>Collision Detection Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SFDE</name>
                        <description>Start of Frame Detection Enable</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENC</name>
                        <description>Encoding Format</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>ENCSelect</name>
                           <enumeratedValue>
                              <name>DISABLE</name>
                              <description>Data is not encoded</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IRDA</name>
                              <description>Data is IrDA encoded</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PMODE</name>
                        <description>Parity Mode</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>PMODESelect</name>
                           <enumeratedValue>
                              <name>EVEN</name>
                              <description>Even Parity</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>ODD</name>
                              <description>Odd Parity</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXEN</name>
                        <description>Transmitter Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXEN</name>
                        <description>Receiver Enable</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOCLR</name>
                        <description>FIFO Clear</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>FIFOCLRSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>No action</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TXFIFO</name>
                              <description>Clear TX FIFO</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RXFIFO</name>
                              <description>Clear RX FIFO</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BOTH</name>
                              <description>Clear both TX and RF FIFOs</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>LINCMD</name>
                        <description>LIN Command</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>LINCMDSelect</name>
                           <enumeratedValue>
                              <name>NONE</name>
                              <description>Normal USART transmission</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SOFTWARE_CONTROL_TRANSMIT_CMD</name>
                              <description>Break field is transmitted when DATA is written</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AUTO_TRANSMIT_CMD</name>
                              <description>Break, sync and identifier are automatically transmitted when DATA is written with the identifier</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLC</name>
                  <description>USART_EXT Control C</description>
                  <addressOffset>0x8</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GTIME</name>
                        <description>Guard Time</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>BRKLEN</name>
                        <description>LIN Master Break Length</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>BRKLENSelect</name>
                           <enumeratedValue>
                              <name>13_BIT</name>
                              <description>Break field transmission is 13 bit times</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>17_BIT</name>
                              <description>Break field transmission is 17 bit times</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>21_BIT</name>
                              <description>Break field transmission is 21 bit times</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>26_BIT</name>
                              <description>Break field transmission is 26 bit times</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>HDRDLY</name>
                        <description>LIN Master Header Delay</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>HDRDLYSelect</name>
                           <enumeratedValue>
                              <name>DELAY0</name>
                              <description>Delay between break and sync transmission is 1 bit time; Delay between sync and ID transmission is 1 bit time</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY1</name>
                              <description>Delay between break and sync transmission is 4 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY2</name>
                              <description>Delay between break and sync transmission is 8 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DELAY3</name>
                              <description>Delay between break and sync transmission is 14 bit time; Delay between sync and ID transmission is 4 bit time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INACK</name>
                        <description>Inhibit Not Acknowledge</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DSNACK</name>
                        <description>Disable Successive NACK</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MAXITER</name>
                        <description>Maximum Iterations</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>DATA32B</name>
                        <description>Data 32 Bit</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DATA32BSelect</name>
                           <enumeratedValue>
                              <name>0x0</name>
                              <description>Reads and writes with CHSIZE</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x1</name>
                              <description>Reads with CHSIZE, writes with 32-bit extension</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x2</name>
                              <description>Reads with 32-bit extension, writes with CHSIZE</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0x3</name>
                              <description>Reads and writes with 32-bit extension</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>FIFOEN</name>
                        <description>FIFO Enable</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXTRHOLD</name>
                        <description>Receive FIFO Threshold</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>RXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated when DATA is present in the FIFO</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is half-full</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FULL</name>
                              <description>Interrupt and DMA triggers are generated when FIFO is full</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TXTRHOLD</name>
                        <description>Transmit FIFO Threshold</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>TXTRHOLDSelect</name>
                           <enumeratedValue>
                              <name>DEFAULT</name>
                              <description>Interrupt and DMA triggers are generated as long as the FIFO is not full</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALF</name>
                              <description>Interrupt and DMA triggers are generated when half FIFO space is free</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EMPTY</name>
                              <description>Interrupt and DMA triggers are generated when the FIFO is empty</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD</name>
                  <description>USART_EXT Baud Rate</description>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRAC_MODE</name>
                  <description>USART_EXT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_FRACFP_MODE</name>
                  <description>USART_EXT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>13</bitWidth>
                     </field>
                     <field>
                        <name>FP</name>
                        <description>Fractional Part</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BAUD_USARTFP_MODE</name>
                  <description>USART_EXT Baud Rate</description>
                  <alternateRegister>BAUD</alternateRegister>
                  <addressOffset>0xC</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BAUD</name>
                        <description>Baud Rate Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RXPL</name>
                  <description>USART_EXT Receive Pulse Length</description>
                  <addressOffset>0xE</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>RXPL</name>
                        <description>Receive Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
